StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730e/phl/hal_g6/rtl8730e/axi/hal_trx_8730ea.c
/******************************************************************************
 *
 * Copyright(c) 2019 Realtek Corporation.
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 *****************************************************************************/
#define _HAL_TRX_8730EA_C_
#include "../../hal_headers.h"
#include "../rtl8730e_hal.h"
#include "hal_trx_8730ea.h"
#ifdef RTW_PHL_BCN_IOT
#include "mac/mac_ax/bcn.h"
#endif

/**
 * this function will query total hw tx dma channels number
 *
 * returns the number of hw tx dma channel
 */
static u8 hal_query_txch_num_8730ea(void)
{
	u8 ch_num = 0;

	ch_num = TX_DMA_CHANNEL_ENTRY_8730EA;

	return ch_num;
}

/**
 * this function will query total hw rx dma channels number
 *
 * returns the number of hw rx dma channel
 */
static u8 hal_query_rxch_num_8730ea(void)
{
	u8 ch_num = 0;

	ch_num = RX_DMA_CHANNEL_ENTRY_8730EA;

	return ch_num;
}
static u8 hal_qsel_to_tid_8730ea(struct hal_info_t *hal, u8 qsel_id, u8 tid_indic)
{
	u8 tid = 0;

	switch (qsel_id) {
	case RTW_TXDESC_QSEL_BE:
		tid = (1 == tid_indic) ? RTW_PHL_RING_CAT_TID3 : RTW_PHL_RING_CAT_TID0;
		break;
	case RTW_TXDESC_QSEL_BK:
		tid = (1 == tid_indic) ? RTW_PHL_RING_CAT_TID2 : RTW_PHL_RING_CAT_TID1;
		break;
	case RTW_TXDESC_QSEL_VI:
		tid = (1 == tid_indic) ? RTW_PHL_RING_CAT_TID5 : RTW_PHL_RING_CAT_TID4;
		break;
	case RTW_TXDESC_QSEL_VO:
		tid = (1 == tid_indic) ? RTW_PHL_RING_CAT_TID7 : RTW_PHL_RING_CAT_TID6;
		break;
	case RTW_TXDESC_QSEL_MGT:
		tid = RTW_PHL_RING_CAT_MGNT;
		break;
	case RTW_TXDESC_QSEL_HIGH:
		tid = RTW_PHL_RING_CAT_HIQ;
		break;
	default :
		PHL_TRACE(COMP_PHL_DBG, _PHL_WARNING_, "[WARNING]unknown qsel_id (%d)\n",
			  qsel_id);
		tid = 0;
		break;
	}

	return tid;
}

/**
 * Get target DMA channel's BD num hw register of rtl8730e
 * @dma_ch: input target dma channel with the hw definition of rtl8730ea
 * return the BD num hw register
 */
static u32 _hal_get_bd_num_reg_8730ea(u8 dma_ch)
{
	u32 reg = 0;

	switch (dma_ch) {
	case MGT_QUEUE_IDX_8730EA:
		reg = REG_MGQ_TXBD_NUM;
		break;
	case RX_QUEUE_IDX_8730EA:
		reg = REG_RX_RXBD_NUM;
		break;
	case VO_QUEUE_IDX_8730EA:
		reg = REG_VOQ_TXBD_NUM;
		break;
	case VI_QUEUE_IDX_8730EA:
		reg = REG_VIQ_TXBD_NUM;
		break;
	case BE_QUEUE_IDX_8730EA:
		reg = REG_BEQ_TXBD_NUM;
		break;
	case BK_QUEUE_IDX_8730EA:
		reg = REG_BKQ_TXBD_NUM;
		break;
	case HIGH_QUEUE_IDX_8730EA:
		reg = REG_MQ0_TXBD_NUM;
		break;
	default :
		PHL_TRACE(COMP_PHL_DBG, _PHL_WARNING_, "[WARNING]unknown channel (%d)\n",
			  dma_ch);
		reg = 0xFFFF;
		break;
	}

	return reg;
}


/**
 * Get target DMA channel's BD Desc hw register of rtl8730e
 * @dma_ch: input target dma channel with the hw definition of rtl8730ea
 * return the BD Desc hw register
 */
static void _hal_get_bd_desc_reg_8730ea(u8 dma_ch, u32 *addr_l, u32 *addr_h)
{
	u32 reg = 0;

	switch (dma_ch) {
	case BCN_QUEUE_IDX_8730EA:
		*addr_l = REG_BCNQ_TXBD_DESA;
		break;
	case MGT_QUEUE_IDX_8730EA:
		*addr_l = REG_MGQ_TXBD_DESA;
		break;
	case VO_QUEUE_IDX_8730EA:
		*addr_l = REG_VOQ_TXBD_DESA;
		break;
	case VI_QUEUE_IDX_8730EA:
		*addr_l = REG_VIQ_TXBD_DESA;
		break;
	case BE_QUEUE_IDX_8730EA:
		*addr_l = REG_BEQ_TXBD_DESA;
		break;
	case BK_QUEUE_IDX_8730EA:
		*addr_l = REG_BKQ_TXBD_DESA;
		break;
	case RX_QUEUE_IDX_8730EA:
		*addr_l = REG_RXQ_RXBD_DESA;
		break;
	case HIGH_QUEUE_IDX_8730EA:
		*addr_l = REG_MQ0_TXBD_DESA;
		break;
	default :
		PHL_TRACE(COMP_PHL_DBG, _PHL_WARNING_, "[WARNING]unknown channel (%d)\n",
			  dma_ch);
		reg = 0xFFFF;
		break;
	}
	*addr_h = 0;

}



/**
 * Get target DMA channel's BD Index hw register of rtl8730e
 * @dma_ch: input target dma channel with the hw definition of rtl8730ea
 * return the BD Index hw register
 */
static u32 _hal_get_bd_idx_reg_8730ea(u8 dma_ch)
{
	u32 reg = 0;

	switch (dma_ch) {
	case VO_QUEUE_IDX_8730EA:
		reg = REG_VOQ_TXBD_IDX;
		break;
	case VI_QUEUE_IDX_8730EA:
		reg = REG_VIQ_TXBD_IDX;
		break;
	case BE_QUEUE_IDX_8730EA:
		reg = REG_BEQ_TXBD_IDX;
		break;
	case BK_QUEUE_IDX_8730EA:
		reg = REG_BKQ_TXBD_IDX;
		break;
	case MGT_QUEUE_IDX_8730EA:
		reg = REG_MGQ_TXBD_IDX;
		break;
	case HIGH_QUEUE_IDX_8730EA:
		reg = REG_MQ0_TXBD_IDX;
		break;
	case RX_QUEUE_IDX_8730EA:
		reg = REG_RXQ_RXBD_IDX;
		break;
	default :
		PHL_TRACE(COMP_PHL_DBG, _PHL_WARNING_, "[WARNING]unknown channel (%d)\n",
			  dma_ch);
		reg = 0xFFFF;
		break;
	}

	return reg;
}


/**
 * this function maps the sw xmit ring identified by macid, tid and band
 * to rtl8730ea hw tx dma channel
 * @macid: input target macid range is 0 ~ 127
 * @cat: input target packet category, see enum rtw_phl_ring_cat
 * @band: input target band, 0 for band 0 / 1 for band 1
 *
 * returns the mapping hw dma channel defined by XXX_QUEUE_IDX_8730EA
 * if the input parameter is unknown value, returns BE_QUEUE_IDX_8730EA
 */
static u8 hal_mapping_hw_tx_chnl_8730ea(u16 macid, enum rtw_phl_ring_cat cat,
					u8 band)
{
	u8 dma_ch = 0;

	/* hana_todo, decided by cat only currently,
		we should consider more situation later */

	if (0 == band) {
		switch (cat) {
		case RTW_PHL_RING_CAT_TID0:
		case RTW_PHL_RING_CAT_TID3:
			dma_ch = BE_QUEUE_IDX_8730EA;
			break;
		case RTW_PHL_RING_CAT_TID1:
		case RTW_PHL_RING_CAT_TID2:
			dma_ch = BK_QUEUE_IDX_8730EA;
			break;
		case RTW_PHL_RING_CAT_TID4:
		case RTW_PHL_RING_CAT_TID5:
			dma_ch = VI_QUEUE_IDX_8730EA;
			break;
		case RTW_PHL_RING_CAT_TID6:
		case RTW_PHL_RING_CAT_TID7:
			dma_ch = VO_QUEUE_IDX_8730EA;
			break;
		case RTW_PHL_RING_CAT_MGNT:
			dma_ch = MGT_QUEUE_IDX_8730EA;
			break;
		case RTW_PHL_RING_CAT_HIQ:
			dma_ch = HIGH_QUEUE_IDX_8730EA;
			break;
		default:
			dma_ch = BE_QUEUE_IDX_8730EA;
			PHL_TRACE(COMP_PHL_DBG, _PHL_WARNING_, "[WARNING]unknown category (%d)\n",
				  cat);
			break;
		}
	} else {
		dma_ch = BE_QUEUE_IDX_8730EA;
		PHL_TRACE(COMP_PHL_DBG, _PHL_WARNING_, "[WARNING]unknown band (%d)\n",
			  band);
	}

