StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730e/phl/hal_g6/rtl8730e/axi/hal_trx_8730ea.c
		if (mdata->bk || mdata->ack_ch_info) {
			w2 |= AX_TXD_BK;
		}

		w2 |= (qsel_tbl[mdata->tid] & AX_TXD_QSEL_MSK) << AX_TXD_QSEL_SH;
		wd_words[2] = cpu_to_le32(w2);

		*wd_len = req->wd_len;
	}

	return RTW_HAL_STATUS_SUCCESS;
}
#endif

/**
 * the function update wd page, including wd info, wd body, seq info, addr info
 * @hal: see struct hal_info_t
 * @phl_pkt_req: see struct rtw_phl_pkt_req
 */
static enum rtw_hal_status
hal_update_wd_8730ea(struct hal_info_t *hal,
		     struct rtw_phl_pkt_req *req) {
	enum rtw_hal_status hstatus = RTW_HAL_STATUS_SUCCESS;
	struct rtw_hal_com_t *hal_com = hal->hal_com;
	struct bus_hw_cap_t *bus_hw_cap = &hal_com->bus_hw_cap;
	struct rtw_xmit_req *tx_req = NULL;
	struct rtw_pkt_buf_list *pkt_list = NULL;
	u32 wd_len = 0, seq_ofst = 0, addr_info_ofst = 0;
	u16 wp_seq = 0;
	u8 i = 0, wp_num = 0, mpdu_ls = 0, msdu_ls = 0, tid_indic = 0;
	u8 buf_len = 0;
	FUNCIN_WSTS(hstatus);
	do
	{
		if (NULL == req) {
			break;
		}

		tx_req = req->tx_req;
		pkt_list = (struct rtw_pkt_buf_list *)tx_req->pkt_list;

#ifdef CONFIG_PHL_TXSC
		_hal_txsc_update_wd(hal, req, &wd_len);
#else
		/* connect with halmac */
		rtw_hal_mac_ax_fill_txdesc(hal->mac, tx_req, req->wd_page,
					   &wd_len);
#endif
		tid_indic = _hal_get_tid_indic_8730ea(tx_req->mdata.tid);

		buf_len += (u8)wd_len;
		req->total_len = wd_len;
		req->seg_num = 0;
		addr_info_ofst = wd_len;

		PHL_TRACE(COMP_PHL_XMIT, _PHL_DEBUG_, "after halmac update wd, wd_len = 0x%x, seq_info_size = 0x%x\n", wd_len, bus_hw_cap->seq_info_size);

		for (i = 0; i < tx_req->mdata.addr_info_num; i++) {
			if (0 == i) {
				wp_num = tx_req->mdata.addr_info_num;
			} else {
				wp_num = 0;
			}

			if ((tx_req->mdata.addr_info_num - 1) == i) {
				msdu_ls = 1;
			} else {
				msdu_ls = 0;
			}

			if (i == tx_req->mdata.addr_info_num - 1) {
				_hal_fill_wp_addr_info_8730ea(hal_com,
							      req->wd_page + addr_info_ofst,
							      &pkt_list[i], wp_num, mpdu_ls, msdu_ls, true);
			} else {
				_hal_fill_wp_addr_info_8730ea(hal_com,
							      req->wd_page + addr_info_ofst,
							      &pkt_list[i], wp_num, mpdu_ls, msdu_ls, false);
			}

			addr_info_ofst += bus_hw_cap->addr_info_size;
			buf_len += bus_hw_cap->addr_info_size;
			req->total_len += pkt_list[i].length;
			req->seg_num++;
		}
		req->wd_len = buf_len;
		PHL_TRACE(COMP_PHL_XMIT, _PHL_DEBUG_, "req->wd_len = 0x%x\n", req->wd_len);
	} while (false);

#if 0 /* remove this for saving cpu cycle */
	if (RTW_HAL_STATUS_SUCCESS == hstatus)
	{
		debug_dump_data(req->wd_page, (u16)addr_info_ofst, "dump wd page");
	}
#endif
	FUNCOUT_WSTS(hstatus);
	return hstatus;
}

/**
 * the function update txbd
 * @hal: see struct hal_info_t
 * @txbd_ring: the target txbd ring buffer going to update, see struct tx_base_desc
 * @wd: the wd page going to be filled in txbd, see struct rtw_wd_page
 */
static enum rtw_hal_status
hal_update_txbd_8730ea(struct hal_info_t *hal,
		       struct tx_base_desc *txbd_ring,
		       struct rtw_wd_page *wd_page,
		       u8 ch_idx, u16 wd_num) {
	enum rtw_hal_status hstatus = RTW_HAL_STATUS_SUCCESS;
	struct rtw_hal_com_t *hal_com = hal->hal_com;
	struct bus_hw_cap_t *bus_hw_cap = &hal_com->bus_hw_cap;
	u8 *ring_head = 0;
	int i = 0;
	u8 *target_txbd = 0, *add_info = 0;
	u16 host_idx = 0, txbd_host_idx = 0, hw_idx = 0;
	u16 avail_txbd = 0, wcnt = 0;
	u16 txbd_num = (u16)hal_com->bus_cap.txbd_num;
	u16 seg_num = ((TX_BUFFER_SEG_NUM == 0) ? 2 : ((TX_BUFFER_SEG_NUM == 1) ? 4 : 8));
	int sub_seg_num = 0;

	do
	{
		if (NULL == wd_page) {
			break;
		}
		if (NULL == txbd_ring) {
			break;
		}

		/* connect with halmac */
		host_idx = txbd_ring[ch_idx].host_idx;
		avail_txbd = hal_get_avail_txbd_8730ea(hal->hal_com, ch_idx,
						       &txbd_host_idx, &hw_idx);

		wcnt = (wd_num > avail_txbd) ? avail_txbd : wd_num;

		PHL_TRACE(COMP_PHL_XMIT, _PHL_DEBUG_,
			  "hal_update_txbd_8730ea => ch_idx %d, host_idx %d, "
			  "hw_idx %d, avail_txbd %d, wcnt %d\n",
			  ch_idx, txbd_host_idx, hw_idx, avail_txbd, wcnt);

		while (wcnt > 0) {

			ring_head = txbd_ring[ch_idx].vir_addr;
			target_txbd = ring_head + (host_idx *
						   bus_hw_cap->txbd_len);

			SET_TXBUFFER_DESC_LEN(target_txbd, 0);
			SET_TXBUFFER_DESC_PSB(target_txbd, 0);
			SET_TXBUFFER_DESC_ADD_LOW(target_txbd, 0);

			for (i = 1 ; i < seg_num ; i++) {
				SET_TXBUFFER_DESC_LEN_WITH_OFFSET(target_txbd, i, 0);
				SET_TXBUFFER_DESC_MODE_WITH_OFFSET(target_txbd, i, 0);
				SET_TXBUFFER_DESC_ADD_LOW_WITH_OFFSET(target_txbd, i, 0);
			}

			SET_TXBUFFER_DESC_LEN(target_txbd, TX_WIFI_INFO_SIZE);
			SET_TXBUFFER_DESC_PSB(target_txbd, RTW_DIV_ROUND_UP(wd_page->total_len, TXBD_PAGE_SIZE));
			SET_TXBUFFER_DESC_ADD_LOW(target_txbd, wd_page->phy_addr_l);

			add_info = wd_page->phy_addr_l + TX_WIFI_INFO_SIZE;
			sub_seg_num = (int)(wd_page->seg_num);

			SET_TXBUFFER_DESC_MODE_WITH_OFFSET(target_txbd, 1, 1);
			SET_TXBUFFER_DESC_ADD_LOW_WITH_OFFSET(target_txbd, 1, add_info);
			SET_TXBUFFER_DESC_LEN_WITH_OFFSET(target_txbd, 1, sub_seg_num * 8);

			PHL_TRACE(COMP_PHL_XMIT, _PHL_DEBUG_, "wd_page->buf_len = 0x%x\n", wd_page->buf_len);
			PHL_TRACE(COMP_PHL_XMIT, _PHL_DEBUG_, "wd_page->phy_addr_l = 0x%x\n", wd_page->phy_addr_l);

			host_idx = (host_idx + 1) % txbd_num;
			wd_page->host_idx = host_idx;
			wcnt--;
			//multi wd page in one update txbd
#if 0//S_TODO
			if (wcnt > 0) {
				wd_page = list_first_entry(wd_page->list,
							   struct rtw_wd_page,
							   wd_page->list);
				if (NULL == wd_page) {
					break;
				}
			}
#endif
		}

		txbd_ring[ch_idx].host_idx = host_idx;
	} while (false);

	return hstatus;
}

#ifdef RTW_PHL_BCN_IOT
static enum rtw_hal_status
hal_update_bcn_txbd_8730ea(struct hal_info_t *hal,
			   struct tx_base_desc *txbd_ring,
			   void *info) {
	enum rtw_hal_status hstatus = RTW_HAL_STATUS_SUCCESS;
	struct rtw_hal_com_t *hal_com = hal->hal_com;
	struct mac_ax_bcn_priv *bcn_info = (struct mac_ax_bcn_priv *)info;
	struct bus_hw_cap_t *bus_hw_cap = &hal_com->bus_hw_cap;
	u16 seg_num = ((TX_BUFFER_SEG_NUM == 0) ? 2 : ((TX_BUFFER_SEG_NUM == 1) ? 4 : 8));
	u8 ch_idx = BCN_QUEUE_IDX_8730EA;
	u8 *ring_head = 0;
	int i = 0;
	u8 *target_txbd = 0;
	u16 total_len = 0;

