StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730e/phl/hal_g6/rtl8730e/axi/hal_trx_8730ea.c
	total_len = bcn_info->desc_len + bcn_info->bcn_len;
	ring_head = txbd_ring[ch_idx].vir_addr;
	target_txbd = ring_head;

	SET_TXBUFFER_DESC_LEN(target_txbd, 0);
	SET_TXBUFFER_DESC_PSB(target_txbd, 0);
	SET_TXBUFFER_DESC_ADD_LOW(target_txbd, 0);

	for (i = 1 ; i < seg_num ; i++) {
		SET_TXBUFFER_DESC_LEN_WITH_OFFSET(target_txbd, i, 0);
		SET_TXBUFFER_DESC_MODE_WITH_OFFSET(target_txbd, i, 0);
		SET_TXBUFFER_DESC_ADD_LOW_WITH_OFFSET(target_txbd, i, 0);
	}

	SET_TXBUFFER_DESC_LEN(target_txbd, TX_WIFI_INFO_SIZE);
	SET_TXBUFFER_DESC_PSB(target_txbd, RTW_DIV_ROUND_UP(total_len, TXBD_PAGE_SIZE));
	SET_TXBUFFER_DESC_ADD_LOW(target_txbd, bcn_info->desc_phy_addr);
	SET_TXBUFFER_DESC_OWN(target_txbd, 1);

	SET_TXBUFFER_DESC_MODE_WITH_OFFSET(target_txbd, 1, 0);
	SET_TXBUFFER_DESC_ADD_LOW_WITH_OFFSET(target_txbd, 1, bcn_info->bcn_phy_addr);
	SET_TXBUFFER_DESC_LEN_WITH_OFFSET(target_txbd, 1, bcn_info->bcn_len);

	return hstatus;
}

static enum rtw_hal_status
hal_trigger_bcn_8730ea(struct hal_info_t *hal) {
	enum rtw_hal_status hstatus = RTW_HAL_STATUS_FAILURE;
	u8 tx_dma_ch = BCN_QUEUE_IDX_8730EA;
	u32 txbd_reg;
	u16 val16 = 0;

	val16 = hal_read16(hal->hal_com, REG_RX_RXBD_NUM);
	hal_write16(hal->hal_com, REG_RX_RXBD_NUM, val16 | BIT_POLL_BCNQ);
	hstatus = RTW_HAL_STATUS_SUCCESS;

	return hstatus;
}
#endif

/**
 * the function trigger tx start
 * @hal: see struct hal_info_t
 * @txbd_ring: the target txbd ring buffer going to update, see struct tx_base_desc
 * @ch_idx: the dma channel index of this txbd_ring
 */
static enum rtw_hal_status
hal_trigger_txdma_8730ea(struct hal_info_t *hal,
			 struct tx_base_desc *txbd_ring, u8 ch_idx) {
	enum rtw_hal_status hstatus = RTW_HAL_STATUS_FAILURE;
	u8 tx_dma_ch;
	u32 txbd_reg;

	do
	{
		/* connect with halmac */
		tx_dma_ch = BE_QUEUE_IDX_8730EA + ch_idx;
		txbd_reg = _hal_get_bd_idx_reg_8730ea(tx_dma_ch);
		if (0xFFFF == txbd_reg) {
			break;
		}

		PHL_TRACE(COMP_PHL_XMIT, _PHL_DEBUG_,
			  "hal_trigger_txdma_8730ea => dma_ch %d, host_idx %d.\n",
			  ch_idx, txbd_ring[ch_idx].host_idx);
		hal_write16(hal->hal_com, txbd_reg, txbd_ring[ch_idx].host_idx);
		hstatus = RTW_HAL_STATUS_SUCCESS;
	} while (false);

	return hstatus;
}

static enum rtw_hal_status hal_pltfm_tx_8730ea(void *hal, struct rtw_h2c_pkt *h2c_pkt)
{
	enum rtw_hal_status hstatus = RTW_HAL_STATUS_SUCCESS;
#if 0

	struct hal_info_t *hal_info = (struct hal_info_t *)hal;
	struct rtw_wd_page wd_page;
	struct tx_base_desc *txbd_ring = NULL;

	_os_mem_set(hal_to_drvpriv(hal_info), &wd_page, 0, sizeof(wd_page));

	txbd_ring = (struct tx_base_desc *)hal_info->hal_com->fw_txbd;
	wd_page.vir_addr = h2c_pkt->vir_addr;
	wd_page.phy_addr_l = h2c_pkt->phy_addr_l;
	wd_page.phy_addr_h = h2c_pkt->phy_addr_h;
	wd_page.buf_len = h2c_pkt->buf_len;
	wd_page.cache = 1;

	_os_spinlock(hal_to_drvpriv(hal_info), &txbd_ring[FWCMD_QUEUE_IDX_8730EA].txbd_lock, _ps, NULL);
	hstatus = hal_update_txbd_8730ea(hal_info, txbd_ring, &wd_page,
					 FWCMD_QUEUE_IDX_8730EA, 1);
	_os_spinunlock(hal_to_drvpriv(hal_info), &txbd_ring[FWCMD_QUEUE_IDX_8730EA].txbd_lock, _ps, NULL);

	/* enqueue busy queue */

	hstatus = hal_trigger_txdma_8730ea(hal_info, txbd_ring, FWCMD_QUEUE_IDX_8730EA);
#endif
	return hstatus;
}

static u8 hal_check_rxrdy_8730ea(struct rtw_phl_com_t *phl_com, u8 *rxbd_info,
				 u8 ch_idx)
{
	struct hal_spec_t *hal_spec = &phl_com->hal_spec;
	u8 res = true;
	u8 first_seg = 0, last_seg = 0;
	u16 total_len = 0, read_cnt = 0;
	do {
		if (rxbd_info == NULL) {
			PHL_TRACE(COMP_PHL_DBG, _PHL_WARNING_,
				  "[WARNING] input rx bd info is NULL!\n");
			res = false;
			break;
		}

		total_len = (u16)GET_RX_BD_INFO_TOTALRXPKTSIZE(rxbd_info);
		first_seg = (u8)GET_RX_BD_INFO_FS(rxbd_info);
		last_seg = (u8)GET_RX_BD_INFO_LS(rxbd_info);

		while (total_len == 0) {
			read_cnt++;

			total_len = (u16)GET_RX_BD_INFO_TOTALRXPKTSIZE(rxbd_info);
			first_seg = (u8)GET_RX_BD_INFO_FS(rxbd_info);
			last_seg = (u8)GET_RX_BD_INFO_LS(rxbd_info);

			if (read_cnt > 10000) {
				res = false;
				break;
			}
		}

		PHL_TRACE(COMP_PHL_DBG, _PHL_DEBUG_, "RX:%s exit total_len=%d, rx_tag = %d, first_seg=%d, last_seg=%d, read_cnt %d\n",
			  __func__, total_len, hal_spec->rx_tag[ch_idx],
			  first_seg, last_seg, read_cnt);

	} while (false);

	return res;
}

static void _hal_show_tx_failure_rsn_8730ea(u8 txsts)
{

	switch (txsts) {

	case TX_STATUS_TX_FAIL_REACH_RTY_LMT:
		PHL_TRACE(COMP_PHL_DBG, _PHL_INFO_, "this wp is tx fail (REACH_RTY_LMT)\n");
		break;
	case TX_STATUS_TX_FAIL_LIFETIME_DROP:
		PHL_TRACE(COMP_PHL_DBG, _PHL_INFO_, "this wp is tx fail (LIFETIME_DROP)\n");
		break;
	case TX_STATUS_TX_FAIL_MACID_DROP:
		PHL_TRACE(COMP_PHL_DBG, _PHL_INFO_, "this wp is tx fail (MACID_DROP)\n");
		break;
	case TX_STATUS_TX_FAIL_SW_DROP:
		PHL_TRACE(COMP_PHL_DBG, _PHL_INFO_, "this wp is tx fail (SW_DROP)\n");
		break;
	default:
		PHL_TRACE(COMP_PHL_DBG, _PHL_INFO_, "this wp is tx fail (UNKNOWN)\n");
		break;
	}

}

/**
 * Process Rx PPDU Status with HALMAC API and PHYDM API
 */
static enum rtw_hal_status
hal_handle_ppdusts_8730ea(void *hal, u8 *psbuf, u16 sz,
			  struct rtw_r_meta_data *mdata, struct rx_ppdu_status *rxps) {
	enum rtw_hal_status hstatus = RTW_HAL_STATUS_FAILURE;

	if (mdata->mac_info_vld)
	{
		/*Call HALMAC API HALMAC API*/
		rxps->mac_info_length = 4; //To DO
	}

	rxps->phy_info_length = sz - rxps->mac_info_length;
	if (rxps->phy_info_length > 0)
	{
		/* the remaining length > 4  the phy info is valid */
		/* CALL PHYDM API Here*/
		//rx_desc->mac_id

	}
	hstatus = RTW_HAL_STATUS_SUCCESS;
	return hstatus;
}

/**
 * SW Parsing Rx Desc
 **/
static enum rtw_hal_status
_hal_parsing_rx_wd_8730ea(struct hal_info_t *hal, u8 *desc,
			  struct rtw_r_meta_data *mdata) {
	enum rtw_hal_status hstatus = RTW_HAL_STATUS_FAILURE;

	hstatus = RTW_HAL_STATUS_SUCCESS;
	return hstatus;
}

static u8 hal_handle_rxbd_info_8730ea(struct hal_info_t *hal,
				      u8 *rxbd_info, u16 *size)
{
	u8 res = false;
	u16 pld_size = 0;
	u8 fs = 0, ls = 0;
	u8 pkt_rdy = false;

	do {
		if (NULL == rxbd_info) {
			break;
		}
		if (NULL == size) {
			break;
		}

