StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730e/phl/hal_g6/rtl8730e/axi/hal_trx_8730ea.c
		fs = (u8)GET_RX_BD_INFO_FS(rxbd_info);
		ls = (u8)GET_RX_BD_INFO_LS(rxbd_info);
		pld_size = (u16)GET_RX_BD_INFO_HW_W_SIZE(rxbd_info);

		if (fs == 1) {
			if (ls == 1) {
				pkt_rdy = true;
			} else {
				pkt_rdy = false;
			}

		} else if (fs == 0) {
			if (ls == 1) {
				pkt_rdy = false;
			} else {
				pkt_rdy = false;
			}
		}

		if (pkt_rdy) {
			*size = pld_size;
			res = true;
		} else {
			*size = 0;
			PHL_TRACE(COMP_PHL_DBG, _PHL_WARNING_, "[WARNING] need to handle RX FS/LS\n");
			res = false;
		}
	} while (false);
	return res;
}



/**
 * the function update rxbd
 */
static enum rtw_hal_status
hal_update_rxbd_8730ea(struct hal_info_t *hal, struct rx_base_desc *rxbd,
		       struct rtw_rx_buf *rx_buf) {
	enum rtw_hal_status hstatus = RTW_HAL_STATUS_SUCCESS;
	struct rtw_hal_com_t *hal_com = hal->hal_com;
	struct bus_hw_cap_t *bus_hw_cap = &hal_com->bus_hw_cap;
	u8 *ring_head = NULL;
	u8 *target_rxbd = NULL;
	u16 rxbd_num = (u16)hal_com->bus_cap.rxbd_num;

	do
	{
		if (NULL == rxbd) {
			break;
		}
		if (NULL == rx_buf) {
			break;
		}

		ring_head = rxbd->vir_addr;
		target_rxbd = ring_head + (rxbd->host_idx *
					   bus_hw_cap->rxbd_len);
		/* connect with halmac */
		SET_RX_BD_INFO_FS(target_rxbd, 0);
		SET_RX_BD_INFO_LS(target_rxbd, 0);
		SET_RX_BD_RXBUFFSIZE(target_rxbd, rx_buf->buf_len);
		SET_RX_BD_PHYSICAL_ADDR_LOW(target_rxbd,
					    (u32)rx_buf->phy_addr_l);

		rxbd->host_idx = (rxbd->host_idx + 1) % rxbd_num;
	} while (false);

	return hstatus;
}


/**
 * the function notify rx done
 */
static enum rtw_hal_status
hal_notify_rxdone_8730ea(struct hal_info_t *hal,
			 struct rx_base_desc *rxbd, u8 ch, u16 rxcnt) {
	enum rtw_hal_status hstatus = RTW_HAL_STATUS_FAILURE;
	u32 reg = 0;
	u8 rx_dma_ch = 0;

	do
	{
		rx_dma_ch = RX_QUEUE_IDX_8730EA + ch;
		reg = _hal_get_bd_idx_reg_8730ea(rx_dma_ch);
		/* connect with halmac */
		if (0xFFFF == reg) {
			break;
		}
		hal_write16(hal->hal_com, reg, rxbd->host_idx);
		hstatus = RTW_HAL_STATUS_SUCCESS;
	} while (false);

	return hstatus;
}

static void _hal_trx_init_bd_num_8730ea(struct hal_info_t *hal)
{
	struct rtw_hal_com_t *hal_com = hal->hal_com;
	u16 txbd_num = (u16)hal_com->bus_cap.txbd_num;
	u16 rxbd_num = (u16)hal_com->bus_cap.rxbd_num;
	u32 reg = 0;
	u16 value = 0;
	u8 i = 0;

	for (i = 0; i < TX_DMA_CHANNEL_ENTRY_8730EA; i++) {
		if ((TXCMD_QUEUE_IDX_8730EA == i) \
		    || (BCN_QUEUE_IDX_8730EA == i)) {
			continue;
		}


		value = ((RTL8730AE_SEG_NUM & 0x3) << 12)
			| (txbd_num & 0x3F);

		reg = _hal_get_bd_num_reg_8730ea(i);
		if (0 != reg) {
			hal_write16(hal->hal_com, reg, value);
		} else {
			PHL_ERR("query txbd num reg fail (ch_idx = %d)\n", i);
		}
	}

	value = ((RTL8730AE_SEG_NUM & 0x3) << 12)
		| (rxbd_num & 0x3F);

	reg = _hal_get_bd_num_reg_8730ea(RX_QUEUE_IDX_8730EA);
	if (0 != reg) {
		hal_write16(hal->hal_com, reg, value);
	} else {
		PHL_ERR("query rxbd num reg fail (ch_idx = %d)\n",\
			RX_QUEUE_IDX_8730EA);
	}

	hal_write32(hal->hal_com, REG_BD_RWPTR_CLR, 0xFFFFFFFF);
}


static void _hal_trx_init_bd_8730ea(struct hal_info_t *hal, u8 *txbd_buf, u8 *rxbd_buf)
{
	struct tx_base_desc *txbd = NULL;
	struct rx_base_desc *rxbd = NULL;
	u32 reg_addr_l = 0, reg_addr_h = 0, value32 = 0;
	u8 i = 0, rxch_idx = 0;

	/* Disable Stop RX DMA */
	value32 = hal_read32(hal->hal_com, REG_AXI_CTRL);
	value32 &= ~BIT_STOPRX;
	hal_write32(hal->hal_com, REG_AXI_CTRL, value32);

	/* Clear the pending ISR */
	hal_write32(hal->hal_com, REG_AXI_INTERRUPT, 0xFFFFFFFF);

	if (NULL != txbd_buf && NULL != rxbd_buf) {
		txbd = (struct tx_base_desc *)txbd_buf;
		rxbd = (struct rx_base_desc *)rxbd_buf;

		/* data queue + mgnt queue + high queue */
		for (i = 0; i < TX_DMA_CHANNEL_ENTRY_8730EA; i++) {
			if ((TXCMD_QUEUE_IDX_8730EA == i) \
			    || (BCN_QUEUE_IDX_8730EA == i)) {
				continue;
			}

			switch (i) {
			case MGT_QUEUE_IDX_8730EA:
				value32 = BIT_MGQDESA(txbd[i].phy_addr_l);
				break;
			case VO_QUEUE_IDX_8730EA:
				value32 = BIT_VOQDESA(txbd[i].phy_addr_l);
				break;
			case VI_QUEUE_IDX_8730EA:
				value32 = BIT_VIQDESA(txbd[i].phy_addr_l);
				break;
			case BE_QUEUE_IDX_8730EA:
				value32 = BIT_BEQDESA(txbd[i].phy_addr_l);
				break;
			case BK_QUEUE_IDX_8730EA:
				value32 = BIT_BKQDESA(txbd[i].phy_addr_l);
				break;
			case HIGH_QUEUE_IDX_8730EA:
				value32 = BIT_MQ0DESA(txbd[i].phy_addr_l);
				break;
			default:
				PHL_ERR("not support channel (ch_idx = %d)\n", i);
				break;
			}

			_hal_get_bd_desc_reg_8730ea(i, &reg_addr_l, &reg_addr_h);
			if (0 != reg_addr_l) {
				hal_write32(hal->hal_com, reg_addr_l, value32);
			} else {
				PHL_ERR("query txbd desc reg_addr_l fail (ch_idx = %d)\n", i);
			}
		}

		/* beacon queue */
		value32 = BIT_BPQDESA(txbd[BCN_QUEUE_IDX_8730EA].phy_addr_l);
		_hal_get_bd_desc_reg_8730ea(BCN_QUEUE_IDX_8730EA, &reg_addr_l, &reg_addr_h);
		if (0 != reg_addr_l) {
			hal_write32(hal->hal_com, reg_addr_l, value32);
		} else {
			PHL_ERR("query txbd desc reg_addr_l fail (bcn queue)\n", i);
		}

		/* RX queue */
		value32 = BIT_RXNRML_DESA(rxbd[rxch_idx].phy_addr_l);
		_hal_get_bd_desc_reg_8730ea(RX_QUEUE_IDX_8730EA, &reg_addr_l, &reg_addr_h);
		if (0 != reg_addr_l) {
			hal_write32(hal->hal_com, reg_addr_l, value32);
		} else {
			PHL_ERR("query rxbd desc reg_addr_l fail (ch_idx = %d)\n", i);
		}
	}

	value32 = hal_read32(hal->hal_com, REG_AXI_CTRL);
	value32 |= BIT_MAX_RXDMA(0x03) | BIT_MAX_TXDMA(0x03);
	/* enable total packet length int rxbd[16:31] */
	value32 &= ~BIT_EN_WT_RXTAG;
	hal_write32(hal->hal_com, REG_AXI_CTRL, value32);
}

static void hal_cfg_wow_txdma_8730ea(struct hal_info_t *hal, u8 en)
{

}
static u8 hal_poll_txdma_idle_8730ea(struct hal_info_t *hal)
{
	return true;
}

static u32 hal_check_bcn_status_8730ea(struct hal_info_t *hal)
{
	u32 status = 0;

	if ((hal->txdone_ch_map[0] & BIT_TXBCN1_OK_INT)
#ifdef CONFIG_CONCURRENT_MODE
	    | (hal->txdone_ch_map[2] & BIT_TXBCNOK9_INT)
#endif
	    ) {
		status |= PHL_TX_BCN_OK;
	}

	if ((hal->txdone_ch_map[0] & BIT_TXBCN1_ERR_INT)
#ifdef CONFIG_CONCURRENT_MODE
	    | (hal->txdone_ch_map[2] & BIT_TXBCNERR9_INT)
#endif
	    ) {
		status |= PHL_TX_BCN_ERR;
	}

	if ((hal->txdone_ch_map[2] & BIT_BCNERLY0_INT)
#ifdef CONFIG_CONCURRENT_MODE
	    | (hal->txdone_ch_map[2] & BIT_BCNERLY8_INT)
#endif
	    ) {
		status |= PHL_TX_BCN_EARLY;
	}

