StreamUnlimited/linux/drivers/rtkdrivers/net/wireless/cfg80211_wifi/rtl8730e/phl/hal_g6/rtl8730e/axi/hal_trx_8730ea.c
	return status;
}

static bool hal_check_tx_done_8730ea(struct hal_info_t *hal, u8 dma_ch)
{
	bool ret = false;

	switch (dma_ch) {
	case MGT_QUEUE_IDX_8730EA:
		if (hal->txdone_ch_map[1] & IMR_MGNTDOK_8730E) {
			hal->txdone_ch_map[1] &= ~IMR_MGNTDOK_8730E;
			ret = true;
		} else {
			ret = false;
		}
		break;
	case VO_QUEUE_IDX_8730EA:
		if (hal->txdone_ch_map[1] & IMR_VODOK_8730E) {
			hal->txdone_ch_map[1] &= ~IMR_VODOK_8730E;
			ret = true;
		} else {
			ret = false;
		}
		break;
	case VI_QUEUE_IDX_8730EA:
		if (hal->txdone_ch_map[1] & IMR_VIDOK_8730E) {
			hal->txdone_ch_map[1] &= ~IMR_VIDOK_8730E;
			ret = true;
		} else {
			ret = false;
		}
		break;
	case BE_QUEUE_IDX_8730EA:
		if (hal->txdone_ch_map[1] & IMR_BEDOK_8730E) {
			hal->txdone_ch_map[1] &= ~IMR_BEDOK_8730E;
			ret = true;
		} else {
			ret = false;
		}
		break;
	case BK_QUEUE_IDX_8730EA:
		if (hal->txdone_ch_map[1] & IMR_BKDOK_8730E) {
			hal->txdone_ch_map[1] &= ~IMR_BKDOK_8730E;
			ret = true;
		} else {
			ret = false;
		}
		break;
	case HIGH_QUEUE_IDX_8730EA:
		if (hal->txdone_ch_map[1] & IMR_H0DOK_8730E) {
			hal->txdone_ch_map[1] &= ~IMR_H0DOK_8730E;
			ret = true;
		} else {
			ret = false;
		}
		break;
	case BCN_QUEUE_IDX_8730EA:
		break;
	default :
		PHL_TRACE(COMP_PHL_DBG, _PHL_WARNING_, "[WARNING]unknown channel (%d)\n",
			  dma_ch);
		ret = false;
		break;
	}

	return ret;
}

/**
 * the function will deinitializing 8730ea specific data and hw configuration
 */
static void hal_trx_deinit_8730ea(struct hal_info_t *hal)
{
	/*struct rtw_hal_com_t *hal_com = hal->hal_com;*/
}

/**
 * the function will initializing 8730ea specific data and hw configuration
 */
static enum rtw_hal_status hal_trx_init_8730ea(struct hal_info_t *hal, u8 *txbd_buf, u8 *rxbd_buf)
{
	enum rtw_hal_status hstatus = RTW_HAL_STATUS_SUCCESS;
	/* Set AMPDU max agg number to 128 */
	/* CR setting*/
	rtw_hal_mac_set_hw_ampdu_cfg(hal, 0, 0x14, 0xAB);

	_hal_trx_init_bd_8730ea(hal, txbd_buf, rxbd_buf);

	_hal_trx_init_bd_num_8730ea(hal);

	return hstatus;
}

static struct hal_trx_ops ops = {0};
void hal_trx_ops_init_8730ea(void)
{
	ops.init = hal_trx_init_8730ea;
	ops.deinit = hal_trx_deinit_8730ea;
	ops.query_trxring_num = hal_get_trxring_num_8730ea;
	ops.query_tx_res = hal_get_avail_txbd_8730ea;
	ops.query_rx_res = hal_get_avail_rxbd_8730ea;
	ops.cfg_wow_txdma = hal_cfg_wow_txdma_8730ea;
	ops.poll_txdma_idle = hal_poll_txdma_idle_8730ea;
	ops.map_hw_tx_chnl = hal_mapping_hw_tx_chnl_8730ea;
	ops.qsel_to_tid = hal_qsel_to_tid_8730ea;
	ops.query_txch_num = hal_query_txch_num_8730ea;
	ops.query_rxch_num = hal_query_rxch_num_8730ea;
	ops.update_wd = hal_update_wd_8730ea;
	ops.update_txbd = hal_update_txbd_8730ea;
#ifdef RTW_PHL_BCN_IOT
	ops.update_bcn_txbd = hal_update_bcn_txbd_8730ea;
	ops.tx_bcn_start = hal_trigger_bcn_8730ea;
#endif
	ops.tx_start = hal_trigger_txdma_8730ea;
	ops.check_rxrdy = hal_check_rxrdy_8730ea;
	ops.check_bcn_status = hal_check_bcn_status_8730ea;
	ops.check_tx_done = hal_check_tx_done_8730ea;
	ops.handle_rxbd_info = hal_handle_rxbd_info_8730ea;
	ops.handle_rx_buffer = hal_handle_rx_buffer_8730e;
	ops.update_rxbd = hal_update_rxbd_8730ea;
	ops.notify_rxdone = hal_notify_rxdone_8730ea;
}



u32 hal_hook_trx_ops_8730ea(struct rtw_phl_com_t *phl_com,
			    struct hal_info_t *hal_info)
{
	enum rtw_hal_status hstatus = RTW_HAL_STATUS_FAILURE;

	if (NULL != hal_info) {
		hal_trx_ops_init_8730ea();
		hal_info->trx_ops = &ops;
		hstatus = RTW_HAL_STATUS_SUCCESS;
	}

	return hstatus;
}
